In [5]:
#QUE-1
import pandas as pd

data = {
    ('Sales', 'Online'): [12000, 13000, 12500, 14000, 15000, 15500, 16000, 16500],
    ('Sales', 'In-Store'): [30000, 32000, 31000, 34000, 36000, 37000, 38000, 39000],
    ('Expenses', 'Online'): [5000, 5500, 5300, 5800, 6000, 6200, 6400, 6600],
    ('Expenses', 'In-Store'): [10000, 10500, 10200, 11000, 11500, 11800, 12000, 12500]
}

index = pd.MultiIndex.from_product([[2021, 2022], ['Q1', 'Q2', 'Q3', 'Q4']], names=["Year", "Quarter"])

financial_data = pd.DataFrame(data, index=index)

financial_data

              Sales          Expenses
             Online In-Store   Online In-Store
Year Quarter
2021 Q1       12000    30000     5000    10000
     Q2       13000    32000     5500    10500
     Q3       12500    31000     5300    10200
     Q4       14000    34000     5800    11000
2022 Q1       15000    36000     6000    11500
     Q2       15500    37000     6200    11800
     Q3       16000    38000     6400    12000
     Q4       16500    39000     6600    12500

In [9]:
#Answer A
online_sales_q1_2022 = financial_data.loc[(2022, 'Q1'), ('Sales', 'Online')]
online_sales_q1_2022

15000

In [11]:
#Answer B
in_store_expenses_q3_2021 = financial_data.loc[(2021, 'Q3'), ('Expenses', 'In-Store')]
in_store_expenses_q3_2021

10200

In [15]:
#Answer C
total_sales_q4_2021 = financial_data.loc[(2021, 'Q4'), ('Sales', 'Online')] + financial_data.loc[(2021, 'Q4'), ('Sales', 'In-Store')]
total_sales_q4_2021

48000

In [17]:
#Answer D
online_expenses_2022 = financial_data.loc[2022, ('Expenses', 'Online')].sum()
online_expenses_2022

25200

In [19]:
#Answer E
sales_q2_2021 = financial_data.loc[(2021, 'Q2'), 'Sales']
sales_q2_2021

Online      13000
In-Store    32000
Name: (2021, Q2), dtype: int64

In [23]:
#Answer F
max_expense_2022 = financial_data.loc[2022, 'Expenses'].max().max()
max_expense_2022

12500

In [27]:
#QUE-2

store_data = {
    'Store': ['Store A', 'Store B', 'Store A', 'Store B'],
    'Product': ['Product X', 'Product X', 'Product Y', 'Product Y'],
    'Sales': [100, 150, 200, 250]
}
df_store_product_sales = pd.DataFrame(store_data)
stacked_df = df_store_product_sales.set_index(['Store', 'Product']).stack()
stacked_df

Store    Product
Store A  Product X  Sales    100
Store B  Product X  Sales    150
Store A  Product Y  Sales    200
Store B  Product Y  Sales    250
dtype: int64

In [29]:
#QUE-3
unstacked_sales_by_store = df_store_product_sales.set_index(['Store', 'Product']).unstack(level=0)['Sales']
unstacked_sales_by_store

Store      Store A  Store B
Product
Product X      100      150
Product Y      200      250

In [33]:
#QUE-4
employee_data = {
    'Department': ['Sales', 'Sales', 'Marketing', 'Marketing', 'HR', 'HR'],
    'Role': ['Manager', 'Executive', 'Manager', 'Executive', 'Manager', 'Executive'],
    'Employee Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank']
}
df_employee = pd.DataFrame(employee_data).set_index(['Department', 'Role'])
df_employee

                     Employee Name
Department Role
Sales      Manager           Alice
           Executive           Bob
Marketing  Manager         Charlie
           Executive         David
HR         Manager             Eva
           Executive         Frank

In [35]:
#QUE-5
employees_in_marketing = df_employee.loc['Marketing']
employees_in_marketing

          Employee Name
Role
Manager         Charlie
Executive         David

In [37]:
#QUE-6
student_grades_data = {
    'Student': ['John', 'Emily', 'Alex', 'Mia', 'Liam'],
    'Subject': ['Math', 'Science', 'Math', 'English', 'Science'],
    'Grade': [85, 90, 75, 88, 92]
}
df_student_grades = pd.DataFrame(student_grades_data)
sorted_student_grades = df_student_grades.sort_values(by=['Subject', 'Grade'])
sorted_student_grades

  Student  Subject  Grade
3     Mia  English     88
2    Alex     Math     75
0    John     Math     85
1   Emily  Science     90
4    Liam  Science     92

In [39]:
#QUE-7
reset_sorted_grades = sorted_student_grades.reset_index(drop=True)
reset_sorted_grades

  Student  Subject  Grade
0     Mia  English     88
1    Alex     Math     75
2    John     Math     85
3   Emily  Science     90
4    Liam  Science     92

In [41]:
#QUE-8
weather_data = {
    'Date': ['2023-01-01', '2023-01-02', '2023-01-03'],
    'Temperature': [23, 24, 22],
    'Humidity': [88, 85, 90]
}
df_weather = pd.DataFrame(weather_data)
df_weather['Date'] = pd.to_datetime(df_weather['Date'])
weather_indexed = df_weather.set_index('Date')
weather_indexed

            Temperature  Humidity
Date
2023-01-01           23        88
2023-01-02           24        85
2023-01-03           22        90

In [45]:
#QUE-9
product_sales_data = {
    ('Category A', 'Product X'): [100, 200, 300],
    ('Category A', 'Product Y'): [150, 250, 350],
    ('Category B', 'Product Z'): [400, 500, 600]
}
df_product_sales = pd.DataFrame(product_sales_data, index=['Q1', 'Q2', 'Q3'])
flattened_product_sales = df_product_sales.copy()
flattened_product_sales.columns = ['_'.join(col) for col in flattened_product_sales.columns]
flattened_product_sales

    Category A_Product X  Category A_Product Y  Category B_Product Z
Q1                   100                   150                   400
Q2                   200                   250                   500
Q3                   300                   350                   600

In [47]:
#QUE-10
product_data = {
    'Category': ['Electronics', 'Electronics', 'Furniture', 'Furniture'],
    'Product': ['TV', 'Laptop', 'Chair', 'Table'],
    'Sales': [500, 700, 300, 400]
}
df_products = pd.DataFrame(product_data).set_index(['Category', 'Product'])

# Averaging the levels in the Sales column (by Category)
average_sales_by_category = df_products.groupby(level='Category').mean()
average_sales_by_category

             Sales
Category
Electronics  600.0
Furniture    350.0